# DividedSurfaceSplittingCurvesWithMultipleNeighbors Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures..::..DividedSurfaceSplittingCurvesWithMultipleNeighbors Property
BuiltInFailures..::..DividedSurfaceFailures Class See Also
---
A point cannot coincide with end points of more than two curve elements. All curve elements adjacent to such a point are ignored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedSurfaceSplittingCurvesWithMultipleNeighbors { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceSplittingCurvesWithMultipleNeighbors As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedSurfaceSplittingCurvesWithMultipleNeighbors {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace